import pandas as pd
from datetime import datetime

data = {
    '房屋面积': [2000, 1600, 2200, 1800, 2400],
    '卧室数量': [3, 2, 4, 3, 4],
    '浴室数量': [2, 1, 3, 2, 3],
    '车库面积': [400, 250, 500, 350, 450],
    '地下室面积': [600, 500, 800, 550, 700],
    '建筑年份': [1995, 1980, 2005, 1990, 2010],
    '社区质量评分': [8, 6, 9, 7, 8],
    '销售价格': [250000, 150000, 350000, 200000, 400000]
}

df = pd.DataFrame(data)

df['房屋的每平方米价格'] = (df['销售价格'] / df['房屋面积'])
df['实际居住面积'] = (df['房屋面积']-df['地下室面积']-df['车库面积'])

print(df)